erp3l/src/DataProcessors/НастройкаПараметровОтчетовПоУмолчанию/НастройкаПараметровОтчетовПоУмолчанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаПараметровОтчетовПоУмолчанию</name>
  <attributes>
    <name>ВерсияОрганизационнойСтруктуры</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеОбмена</name>
    <type>
      <types>EnumRef.ВыгрузкаЗагрузка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erp3l/src/Enums/СпособыФормированияОтчетов/СпособыФормированияОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияОтчетов</name>
  <enumValues>
    <name>РучноеЗаполнение</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиПоПравилуОбработки</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиСвернувПоАналитикам</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиКонсолидация</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиСвернувПоПериоду</name>
  </enumValues>
  <enumValues>
    <name>ИмпортФНС</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиСвернувПоПроектам</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиСвернувПоОрганизациямПроекта</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическиЭлиминация</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/DataProcessors/НастройкаПараметровОтчетовПоУмолчанию/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВернутьПредставлениеСпособаФормированияОтчета(СтрокаТаблицы) Экспорт
	
	ПредставлениеОтчета = Строка(СтрокаТаблицы.СпособФормированияОтчета);
	Если СтрокаТаблицы.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.АвтоматическиСвернувПоПериоду Тогда
		ПредставлениеОтчета = СтрШаблон(Нстр("ru = '%1
							  |Периодичность: %2'"), ПредставлениеОтчета, Строка(СтрокаТаблицы.Периодичность));
	ИначеЕсли СтрокаТаблицы.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.Импорт Тогда
		ПредставлениеОтчета = СтрШаблон(Нстр("ru = '%1
							  |Внешняя ИБ: %2'"), ПредставлениеОтчета, 
							  ?(ЗначениеЗаполнено(СтрокаТаблицы.ВнешняяИнформационнаяБаза), Строка(СтрокаТаблицы.ВнешняяИнформационнаяБаза) + "
							  |(" + СтрокаТаблицы.ВнешняяИнформационнаяБаза.ТипБД + ")"
							  , "не указана"));
	КонецЕсли;
	
	Возврат ПредставлениеОтчета;
	
КонецФункции

Функция ВернутьТаблицуВалютОтчетности(ВерсияОрганизационнойСтруктуры) Экспорт
	Возврат РегистрыСведений.ВалютыОтчетности.ВернутьТаблицуВалютОтчетности(ВерсияОрганизационнойСтруктуры);			
КонецФункции

#КонецЕсли
